In [45]:
import pandas as pd
df= pd.read_csv('bhp.csv')
df.shape

(13200, 7)

In [46]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [47]:
mean = df.price_per_sqft.mean()
mean

7920.336742424242

In [48]:
sd = df.price_per_sqft.std()
sd

106727.16032810845

In [49]:
df['zscore'] = (df.price_per_sqft-mean)/sd
df['zscore']

0       -0.039553
1       -0.030970
2       -0.033875
3       -0.015697
4       -0.034390
           ...
13195   -0.011537
13196    0.029896
13197   -0.024945
13198    0.023299
13199   -0.045259
Name: zscore, Length: 13200, dtype: float64

In [55]:
df1 = df[(df.zscore < -3) | (df.zscore > 3)]
df1

,location,size,total_sqft,bath,price,bhk,price_per_sqft,zscore
345,other,3 Bedroom,11.0,3.0,74.0,3,672727,6.229030
1106,other,5 Bedroom,24.0,2.0,150.0,5,625000,5.781843
4044,Sarjapur Road,4 Bedroom,1.0,4.0,120.0,4,12000000,112.362023
4924,other,7 BHK,5.0,7.0,115.0,7,2300000,21.476067
11447,Whitefield,4 Bedroom,60.0,4.0,218.0,4,363333,3.330105

In [59]:
df1.shape

(5, 8)

In [60]:
df1 = df[(df.zscore > -3) & (df.zscore < 3)]
df1

,location,size,total_sqft,bath,price,bhk,price_per_sqft,zscore
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699,-0.039553
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615,-0.030970
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305,-0.033875
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245,-0.015697
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250,-0.034390
...,...,...,...,...,...,...,...,...
13195,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689,-0.011537
13196,other,4 BHK,3600.0,5.0,400.00,4,11111,0.029896
13197,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258,-0.024945
13198,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407,0.023299
13199,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090,-0.045259

In [61]:
df1.shape

(13195, 8)

In [62]:
df.shape

(13200, 8)

In [63]:
df1.describe()

,total_sqft,bath,price,bhk,price_per_sqft,zscore
count,13195.000000,13195.00000,13195.000000,13195.000000,13195.000000,13195.000000
mean,1555.884482,2.69064,112.267415,2.800152,6713.708602,-0.011306
std,1237.196807,1.33853,149.200669,1.292344,4876.727718,0.045693
min,15.000000,1.00000,8.000000,1.000000,267.000000,-0.071709
25%,1100.000000,2.00000,50.000000,2.000000,4266.500000,-0.034235
50%,1275.000000,2.00000,71.740000,3.000000,5434.000000,-0.023296
75%,1672.500000,3.00000,120.000000,3.000000,7313.000000,-0.005691
max,52272.000000,40.00000,3600.000000,43.000000,200000.000000,1.799726

In [64]:
df = pd.read_csv('height_weight.csv')
df.shape

(10000, 3)

In [65]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [66]:
Q1= df.Height.quantile(0.25)
Q1

63.505620481218955

In [67]:
Q3= df.Height.quantile(0.75)
Q3

69.1742617268347

In [68]:
IQR= Q3-Q1
LB =(IQR - 1.5*Q1)
LB

-89.58978947621269

In [69]:
UB =(Q3 + 1.5*Q1)
UB

164.43269244866315

In [70]:
df1=df [(df.Height <LB)| (df.Height >UB)]
df1

Empty DataFrame
Columns: [Gender, Height, Weight]
Index: []

In [71]:
df1=df [(df.Height >LB)| (df.Height) <UB]
df1

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [72]:
df1.shape

(10000, 3)

df1.describe()

In [73]:
df1.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [74]:
Q1= df.Weight.quantile(0.25)
Q1

135.8180513055015

In [75]:
Q3= df.Weight.quantile(0.75)
Q3

187.16952486868348

In [76]:
IQR= Q3-Q1
LB =(IQR - 1.5*Q1)
LB

-152.3756033950703

In [77]:
UB =(Q3 + 1.5*Q1)
UB

390.89660182693575

In [78]:
df1=df [(df.Weight <LB)| (df.Weight) >UB]
df1

Empty DataFrame
Columns: [Gender, Height, Weight]
Index: []

In [79]:
df1=df [(df.Weight >LB)| (df.Weight) <UB]
df1

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [80]:
df1.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699